In [2]:
import pandas as pd

In [3]:
import sqlite3

In [6]:
conn = sqlite3.connect("mydatabase.db")

In [13]:
df = pd.read_sql_query("select * from books", conn) # read from database table

DatabaseError: Execution failed on sql 'select * from books': no such table: books

In [8]:
df.head()

   bid          title       author
0    1  Wings of Fire  Abdul Kalam
1    3  Wings of Fire  Abdul Kalam
2    4  Wings of Fire  Abdul Kalam
3    5  Wings of Fire  Abdul Kalam
4    6         Ikigai       Hector

In [4]:
df2 = pd.read_csv("diamonds.csv")

In [7]:
df2.to_sql(name="diamonds1", con=conn, index=False) # save to database table

53940

In [8]:
df2.clarity.value_counts()

SI1     13065
VS2     12258
SI2      9194
VS1      8171
VVS2     5066
VVS1     3655
IF       1790
I1        741
Name: clarity, dtype: int64

In [9]:
df3 = pd.read_sql_query("select * from diamonds1 where clarity='VVS2'", conn) # read from database table

In [10]:
df3.head()

    s  carat        cut color clarity  depth  table  price     x     y     z
0   6   0.24  Very Good     J    VVS2   62.8   57.0    336  3.94  3.96  2.48
1  26   0.23  Very Good     G    VVS2   60.4   58.0    354  3.97  4.01  2.41
2  66   0.28      Ideal     G    VVS2   61.4   56.0    553  4.19  4.22  2.58
3  76   0.26  Very Good     F    VVS2   59.2   60.0    554  4.19  4.22  2.49
4  77   0.26  Very Good     E    VVS2   59.9   58.0    554  4.15  4.23  2.51

In [11]:
df3.to_csv("VVS2.csv", index=False)

In [12]:
df3.info

<bound method DataFrame.info of           s  carat        cut color clarity  depth  table  price     x     y  \
0         6   0.24  Very Good     J    VVS2   62.8   57.0    336  3.94  3.96
1        26   0.23  Very Good     G    VVS2   60.4   58.0    354  3.97  4.01
2        66   0.28      Ideal     G    VVS2   61.4   56.0    553  4.19  4.22
3        76   0.26  Very Good     F    VVS2   59.2   60.0    554  4.19  4.22
4        77   0.26  Very Good     E    VVS2   59.9   58.0    554  4.15  4.23
...     ...    ...        ...   ...     ...    ...    ...    ...   ...   ...
5061  53841   0.71       Good     H    VVS2   60.4   63.0   2738  5.69  5.74
5062  53855   0.51      Ideal     D    VVS2   61.7   56.0   2742  5.16  5.14
5063  53856   0.51      Ideal     D    VVS2   61.3   57.0   2742  5.17  5.14
5064  53886   0.75  Very Good     I    VVS2   62.0   59.0   2749  5.81  5.83
5065  53900   0.72      Ideal     H    VVS2   62.3   56.0   2752  5.74  5.81

         z
0     2.48
1     2.41
2     2.58
3     2.49
4     2.51
...    ...
5061  3.45
5062  3.18
5063  3.16
5064  3.61
5065  3.60

[5066 rows x 11 columns]>